benchmark/exec_end_to_end/cavity/cavity_rag/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.1;

vertices
(
    (0 0 0) // v0
    (1 0 0) // v1
    (1 1 0) // v2
    (0 1 0) // v3
    (0 0 0.1) // v4
    (1 0 0.1) // v5
    (1 1 0.1) // v6
    (0 1 0.1) // v7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 20 1) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    wall movingWall
    (
        (3 2 6 7)
    )
    wall fixedWalls
    (
        (0 1 5 4) // bottom
        (0 3 7 4) // left
        (1 2 6 5) // right
    )
    empty frontAndBack
    (
        (0 3 2 1) // front
        (4 5 6 7) // back
    )
);

// ************************************************************************* //