benchmark/exec_end_to_end/cavity/cavity_rag/Allrun
#!/bin/sh
cd "${0%/*}" || exit 1
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions

# Auto-generated by IteraSim Copilot — Allrun
runApplication blockMesh
runApplication icoFoam
